app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."is_record" = ?  [["is_record", 0]]
---
  def index
    @records = Post.where(is_record: true)

INSERT INTO "posts" ("date", "push_up", "sit_up", "run", "created_at", "updated_at", "is_record") VALUES (?, ?, ?, ?, ?, ?, ?)  [["date", "2021-03-21"], ["push_up", 35], ["sit_up", 53], ["run", "12-40"], ["created_at", "2021-03-22 20:06:26.435422"], ["updated_at", "2021-03-22 20:06:26.435422"], ["is_record", "true"]]
---
  def create
    @post = Post.new(date: params[:date],
                     push_up: params[:push_up],
                     sit_up: params[:sit_up],
                     run_min: params[:run_min],
                     run_sec: params[:run_sec],
                     is_record: params[:is_record])
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @id = params[:id]
    @post = Post.find_by(id: @id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "posts" SET "run_sec" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["run_sec", 31], ["updated_at", "2021-03-24 02:57:36.173923"], ["id", 10]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.push_up = params[:push_up]
    @post.sit_up = params[:sit_up]
    @post.run_min = params[:run_min]
    @post.run_sec = params[:run_sec]
    if @post.save