app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."is_record" = ? AND "posts"."user_id" = ?  [["is_record", 0], ["user_id", 1]]
---
  def index
    @records = Post.where(is_record: true, user_id: @current_user.id)