app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "age", "height", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "TEST"], ["password", "test"], ["age", 20], ["height", 170], ["weight", 60], ["created_at", "2021-03-29 20:47:42.936889"], ["updated_at", "2021-03-29 20:47:42.936889"]]
---
  def create
    @user = User.new(name: params[:name],
                      password: params[:password],
                      age: params[:age],
                      height: params[:height],
                      weight: params[:weight])
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."is_record" = ? AND "posts"."user_id" = ?  [["is_record", 0], ["user_id", 1]]
---
  def show
    @user = User.find_by(id: params[:id])
    @records = Post.where(is_record: true, user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "height" = ?, "weight" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["height", 174], ["weight", 62], ["updated_at", "2021-03-24 05:43:08.545506"], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.password = params[:password]
    @user.age = params[:age]
    @user.height = params[:height]
    @user.weight = params[:weight]
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "Ken"], ["password", "aaa"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(name: params[:name],
                          password: params[:password])